satf-233/Line-follower-robot/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 开启 BLE (Bluedroid)，用于向电脑发送 MJPEG 帧
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=n
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_GATTS_ENABLE=y
# 使用传统 BLE 4.2 广播 API (esp_ble_gap_start_advertising 等)，
# 关闭 BLE 5.0 扩展广播 (它们互斥，且本服务不需要 5.0)
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=n
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# ===== Flash 大小：4MB =====
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# ===== 使用自定义分区表 (partitions.csv) =====
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ===== PSRAM：启用 + 八通道 (Octal) =====
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
# 让 malloc 自动把大块分配放入 PSRAM（大缓冲区/形态学队列依赖此项）
CONFIG_SPIRAM_USE_MALLOC=y

# WiFi/lwIP 与 BLE 库内部内存优先从 PSRAM 分配（不足时自动回退内部 RAM）
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_BT_ALLOCATION_FROM_SPIRAM_FIRST=y

# ===== CPU 频率：240MHz =====
# JPEG 解码是纯 CPU 计算瓶颈，160→240MHz 解码约快 50%（85→~57ms）。
# 240MHz 是 S3 额定最高频率（非超频），发热可忽略。
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=n
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=n
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
